app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 6]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 6]]
---

        <p>Click here to read all <%= link_to pluralize(@movie.reviews.size, 'review '), movie_reviews_path(@movie) %>